cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/versions'

############################################################ 命令行工具
# 数据库
brew 'mariadb'
brew 'mongodb'
brew 'redis'
brew 'postgresql', args: ['with-python']


# python/ruby/nodejs工具
brew 'python'
brew 'mackup'
brew 'python3'
brew 'pypy'
brew 'ruby'
brew 'node'


# 系统
brew 'goaccess'
brew 'htop-osx'
brew 'iftop'
brew 'zsh'
brew 'zsh-completions'

# 替换
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
brew "gnu-sed", args:['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnupg'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/gzip'
brew 'homebrew/dupes/rsync'


# 辅助工具
brew 'openssl'
brew 'aria2'
brew 'asciinema'
brew 'cloc'
brew 'socat'
brew 'ssh-copy-id'
brew 'tcpflow'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'watch'
brew 'vim', args:['override-system-vi']
brew 'wget', args:['with-iri']
brew 'wrk'
brew 'git'
cask 'ngrok'
brew 'imagemagick'
brew 'nginx'
brew 'nmap'
brew 'pngpaste'
brew 'homebrew/dupes/gpatch'

############################################################ 命令行工具

############################################################ GUI工具
# 开发相关
cask "atom"
cask "iterm2"
cask "virtualbox"
cask "vagrant"
cask "sequel-pro"
cask "mysqlworkbench"
cask "beyond-compare"
cask "pycharm"
cask "wireshark"
cask "postman"

# 娱乐
cask "mpv"
cask "neteasemusic"

# 聊天工具
cask "adium"
cask "aliwangwang"
cask "twitter"
cask "qq"
cask "telegram"
cask "skype"

# 辅助工具
cask "dropbox"
cask "eudic"
cask "evernote"
cask "google-chrome"
cask "firefox"
cask "foxmail"
cask "shadowsocksx"
cask "teamviewer"
cask "the-unarchiver"
cask "manico"
cask "appcleaner"
cask "daisydisk"
cask "vmware-fusion"
cask "flux"
cask "cyberduck"
cask "adobe-photoshop-cs6"
cask "omnigraffle"
cask "istat-menus"
cask "sogouinput"

############################################################ GUI工具

############################################################ AppStore
#  Dash   Reeder  Mweb  Copyless
#  Wechat  Upyun  ppduck
############################################################ AppStore
